tap "caskroom/cask"
tap "caskroom/fonts"
brew "mas"

# Essentials
brew "ack"
brew "ccat"
brew "diff-so-fancy"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "thefuck"
brew "tig"
brew "trash"
brew "vim", args: ["with-override-system-vi"]
brew "zsh"

# Services
brew "awscli"
brew "hub"

# HTTP utils
brew "httpie"
brew "wget"
brew "youtube-dl"

# Python
brew "python"
brew "python@2"

# Go
brew "go"

# Other languages
brew "node"
brew "ruby"

# Internet
cask "1password"
cask "firefox"
cask "google-chrome"
cask "limechat"
cask "slack"

# Dev
cask "atom"
cask "iterm2"
cask "jetbrains-toolbox"
cask "meld"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "visual-studio"

# Fonts
cask "font-fantasque-sans-mono"
cask "font-inconsolata"
cask "font-mononoki"

# Desktop essentials
cask "gpg-suite"
cask "keybase"
cask "vlc"
mas "Magnet", id: 441258766
