# Development
brew "direnv"
brew "fzf"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "sops"
brew "zsh"
cask "bitwarden"
cask "cursor"
cask "dbeaver-community"
cask "nordvpn"
cask "raycast"
cask "tailscale-app"

# Development - Git
brew "gh"
brew "git-town"
brew "git"
brew "tig"

# Development - JavaScript
brew "node"

# Development - Python
brew "uv"

# Virtualization
brew "colima"
brew "docker-buildx"
brew "docker"
cask "utm"

# Fonts
cask "font-cascadia-code-nf"
cask "font-cascadia-code"
cask "font-cascadia-mono-nf"
cask "font-cascadia-mono"

# Media
cask "sonos"

# Messaging
cask "discord"
cask "slack"
cask "telegram"
