tap "caskroom/cask"
tap "caskroom/fonts"

# GNU utils
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed", args: ["with-default-names"]

# zsh
brew "zsh"

# Essential utils
brew "ack"
brew "ag"
brew "autoenv"
brew "autojump"
brew "ccat"
brew "diff-so-fancy"
brew "exa"
brew "fpp"
brew "fzf"
brew "git-lfs"
brew "git-recent"
brew "git"
brew "htop"
brew "jq"
brew "thefuck"
brew "tig"
brew "vim", args: ["with-override-system-vi"]

# macOS utils
brew "m-cli"
brew "mas"
brew "trash"

# DevOps
brew "awscli"
brew "packer"
brew "terraform"
brew "vault"

# HTTP utils
brew "httpie"
brew "wget"
brew "youtube-dl"

# Languages
brew "elixir"
brew "go"
brew "node"
brew "python"
brew "python@2"
brew "ruby"
brew "typescript"
cask "haskell-platform"
cask "java"

# Language tools
brew "dep"
brew "rbenv"

# Databases
brew "postgresql"

# Database tools
brew "pgcli"

# Internet
cask "1password"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "slack"

# Dev
brew "hub"
cask "atom"
cask "docker"
cask "gas-mask"
cask "github"
cask "iterm2"
cask "jetbrains-toolbox"
cask "meld"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "visual-studio"

# Fonts
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-hack"
cask "font-inconsolata"
cask "font-input"
cask "font-mononoki"

# Desktop essentials
cask "appcleaner"
cask "calibre"
cask "gpg-suite"
cask "keybase"
cask "vlc"
mas "Magnet", id: 441258766
